modules/testsuite/native-tests/src/test/resources/jaxws/jbws2901/message.xml

<?xml version="1.0"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:jbw="http://jbws2901.jaxws.ws.test.jboss.org/">
   <soapenv:Header/>
   <soapenv:Body>
      <jbw:echoString>
         <!--Optional:-->
         <arg0>Hello</arg0>
      </jbw:echoString>
   </soapenv:Body>
</soapenv:Envelope>
